# SQL Joins

## **Creating Sample Tables**

In [1]:
DROP TABLE IF EXISTS names;
CREATE TEMP TABLE names AS
WITH input_data (iid, first_name, title) AS (
 VALUES
 (1, 'Kate', 'Datacated Visualizer'),
 (2, 'Eric', 'Captain SQL'),
 (3, 'Danny', 'Data Wizard Of Oz'),
 (4, 'Ben', 'Mad Scientist'),
 (5, 'Dave', 'Analytics Heretic'),
 (6, 'Ken', 'The YouTuber')
)
SELECT * FROM input_data;

DROP TABLE IF EXISTS jobs;
CREATE TEMP TABLE jobs AS
WITH input_data (iid, occupation, salary) AS (
 VALUES
 (1, 'Cleaner', 'High'),
 (2, 'Janitor', 'Medium'),
 (3, 'Monkey', 'Low'),
 (6, 'Plumber', 'Ultra'),
 (7, 'Hero', 'Plus Ultra')
)
SELECT * FROM input_data;

In [3]:
SELECT * 
FROM names; 

SELECT * 
FROM jobs;

iid,first_name,title
1,Kate,Datacated Visualizer
2,Eric,Captain SQL
3,Danny,Data Wizard Of Oz
4,Ben,Mad Scientist
5,Dave,Analytics Heretic
6,Ken,The YouTuber

iid,occupation,salary
1,Cleaner,High
2,Janitor,Medium
3,Monkey,Low
6,Plumber,Ultra
7,Hero,Plus Ultra

### **Inner Join**

In [2]:
-- Inner Join
SELECT
  names.iid,
  names.first_name,
  names.title,
  jobs.occupation,
  jobs.salary
FROM names
INNER JOIN jobs
  ON names.iid = jobs.iid;

iid,first_name,title,occupation,salary
1,Kate,Datacated Visualizer,Cleaner,High
2,Eric,Captain SQL,Janitor,Medium
3,Danny,Data Wizard Of Oz,Monkey,Low
6,Ken,The YouTuber,Plumber,Ultra

### **Table & Column References**

In [4]:
SELECT
  names.iid,
  names.first_name,
  names.title,
  jobs.occupation,
  jobs.salary
FROM names
INNER JOIN jobs
  ON names.iid = jobs.iid;

/* Notice how all columns and their tables are listed out in 
	SELECT query */

iid,first_name,title,occupation,salary
1,Kate,Datacated Visualizer,Cleaner,High
2,Eric,Captain SQL,Janitor,Medium
3,Danny,Data Wizard Of Oz,Monkey,Low
6,Ken,The YouTuber,Plumber,Ultra

#### `SELECT *`

In [5]:
-- 1. Using SELECT * 
SELECT *
FROM names
INNER JOIN jobs
  ON names.iid = jobs.iid;

iid,first_name,title,iid,occupation,salary
1,Kate,Datacated Visualizer,1,Cleaner,High
2,Eric,Captain SQL,2,Janitor,Medium
3,Danny,Data Wizard Of Oz,3,Monkey,Low
6,Ken,The YouTuber,6,Plumber,Ultra

#### `SELECT table.*`

In [6]:
-- 2. Using SELECT table.*
SELECT
  names.*,
  jobs.*
FROM names
INNER JOIN jobs
  ON names.iid = jobs.iid;

iid,first_name,title,iid,occupation,salary
1,Kate,Datacated Visualizer,1,Cleaner,High
2,Eric,Captain SQL,2,Janitor,Medium
3,Danny,Data Wizard Of Oz,3,Monkey,Low
6,Ken,The YouTuber,6,Plumber,Ultra

#### No Table References

In [7]:
-- 3. No table references used 
SELECT
  iid,
  first_name,
  title,
  occupation,
  salary
FROM names
INNER JOIN jobs
  ON names.iid = jobs.iid;

: column reference "iid" is ambiguous

#### <mark>Proper Table References</mark>

In [8]:
-- 4. Proper table references used 
SELECT
  names.iid,
  names.first_name,
  names.title,
  jobs.occupation,
  jobs.salary
FROM names
INNER JOIN jobs
  ON names.iid = jobs.iid;

iid,first_name,title,occupation,salary
1,Kate,Datacated Visualizer,Cleaner,High
2,Eric,Captain SQL,Janitor,Medium
3,Danny,Data Wizard Of Oz,Monkey,Low
6,Ken,The YouTuber,Plumber,Ultra